{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "product-game",
    "10": "product-airplane",
    "11": "other-medical",
    "12": "other-astronomything",
    "13": "other-god",
    "14": "other-award",
    "15": "product-software",
    "16": "person-other",
    "17": "product-train",
    "18": "person-soldier",
    "19": "person-actor",
    "2": "product-ship",
    "20": "person-director",
    "21": "person-athlete",
    "22": "other-chemicalthing",
    "23": "person-artist/author",
    "24": "art-film",
    "25": "product-weapon",
    "26": "art-other",
    "27": "person-scholar",
    "28": "art-broadcastprogram",
    "29": "other-disease",
    "3": "person-politician",
    "30": "other-language",
    "31": "art-painting",
    "32": "art-music",
    "33": "product-food",
    "34": "product-car",
    "35": "other-educationaldegree",
    "4": "other-law",
    "5": "art-writtenart",
    "6": "other-livingthing",
    "7": "other-currency",
    "8": "other-biologything",
    "9": "product-other"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "O": 0,
    "art-broadcastprogram": 28,
    "art-film": 24,
    "art-music": 32,
    "art-other": 26,
    "art-painting": 31,
    "art-writtenart": 5,
    "other-astronomything": 12,
    "other-award": 14,
    "other-biologything": 8,
    "other-chemicalthing": 22,
    "other-currency": 7,
    "other-disease": 29,
    "other-educationaldegree": 35,
    "other-god": 13,
    "other-language": 30,
    "other-law": 4,
    "other-livingthing": 6,
    "other-medical": 11,
    "person-actor": 19,
    "person-artist/author": 23,
    "person-athlete": 21,
    "person-director": 20,
    "person-other": 16,
    "person-politician": 3,
    "person-scholar": 27,
    "person-soldier": 18,
    "product-airplane": 10,
    "product-car": 34,
    "product-food": 33,
    "product-game": 1,
    "product-other": 9,
    "product-ship": 2,
    "product-software": 15,
    "product-train": 17,
    "product-weapon": 25
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "task_specific_params": {
    "embedding_dimension": 128
  },
  "torch_dtype": "float32",
  "transformers_version": "4.18.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
